/*
서울에서 경산까지 여행을 하면서 모금 활동을 하려 합니다. 
여행은 서울에서 출발해 다른 도시를 정해진 순서대로 딱 한 번 방문한 후 경산으로 도착할 예정입니다. 
도시를 이동할 때에는 도보 혹은 자전거를 이용합니다. 이때 도보 이동에 걸리는 시간, 도보 이동 시 얻을 모금액, 
자전거 이동에 걸리는 시간, 자전거 이동 시 얻을 모금액이 정해져 있습니다. K시간 이내로 여행할 때 모을 수 있는 최대 모금액을 알아보려 합니다.

solution 함수의 매개변수로 각 도시를 이동할 때 이동 수단별로 걸리는 시간과 모금액을 
담은 2차원 배열 travel과 제한시간 K가 주어집니다. 
제한시간 안에 서울에서 경산까지 여행을 하며 모을 수 있는 최대 모금액을 return 하도록 solution 함수를 작성하세요.

예: 
K	    travel	                                                                                            return
1650	[[500, 200, 200, 100], [800, 370, 300, 120], [700, 250, 300, 90]]	                                660
3000	[[1000, 2000, 300, 700], [1100, 1900, 400, 900], [900, 1800, 400, 700], [1200, 2300, 500, 1200]]	5900
*/

#include <string>
#include <vector>

using namespace std;

int solution(int K, vector<vector<int>> travel) {
    int answer = 0;
    return answer;
}